app/controllers/tickets_controller.rb

  def show
    @ticket = Ticket.find(params[:id])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)

  def edit
    @ticket = Ticket.find(params[:id])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 8)

  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if @ticket.save
---
INSERT INTO `tickets` (`created_at`, `title`, `updated_at`, `description`) VALUES('2009-11-23 02:44:26', 'test', '2009-11-23 02:44:26', '1 2 3')

  def update
    @ticket = Ticket.find(params[:id])

    respond_to do |format|
      if @ticket.update_attributes(params[:ticket])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 8)
UPDATE `tickets` SET `updated_at` = '2009-11-23 04:40:34', `title` = 'ttt gasgd asg sg ', `description` = 'ttt gasdga sg asg asg asg asg' WHERE `id` = 9

  def destroy
    @ticket = Ticket.find(params[:id])
    @ticket.destroy
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)
DELETE FROM `tickets` WHERE `id` = 1